---
kind: other
id: Methods.T:Autodesk.Revit.DB.Wall
zh: 墙、墙体
source: html/f3ad9b32-007e-a113-d314-efb668071180.htm
---
# Wall Methods

**中文**: 墙、墙体

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.